Revit 2023 API
FamilyInstance.GetReferences Method
 Gets family instance references corresponding to the reference planes or reference lines of the given reference type in the instance's family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2018
Syntax
C#
public IList<Reference> GetReferences(
	FamilyInstanceReferenceType referenceType
)
Visual Basic
Public Function GetReferences ( _
	referenceType As FamilyInstanceReferenceType _
) As IList(Of Reference)
Visual C++
public:
IList<Reference^>^ GetReferences(
	FamilyInstanceReferenceType referenceType
)
Parameters
referenceType
Type: Autodesk.Revit.DB.FamilyInstanceReferenceType
 The family reference type.
Return Value
 Returns all the family instance references corresponding to reference planes and reference lines of the given reference type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace